app/controllers/scores_controller.rb

INSERT INTO "scores" ("points", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["points", 5000], ["user_id", 1], ["created_at", "2018-09-10 16:56:52.503463"], ["updated_at", "2018-09-10 16:56:52.503463"]]
---
  def create
    @score = Score.new(points: params[:points], user_id: params[:user_id])
    if @score.save