app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test"], ["created_at", "2018-09-10 16:34:06.588355"], ["updated_at", "2018-09-10 16:34:06.588355"]]
---
  def create
    @user = User.new(name: params[:name])
    if @user.save