app/models/score.rb

  def self.top_ten_scores()
    sorted = Score.all.sort_by {|a| a.points}.reverse()
---
SELECT "scores".* FROM "scores"